vmux0.0.6/ycsbVMs_ycsb_8vms_vmux-dpdk-e810_-1rps_rep0/vm7.log
/nix/store/2vwkssqpzykk37r996cafq7x63imf4sp-openjdk-21+35/bin/java  -classpath /nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/conf:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/core-0.17.0.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/HdrHistogram-2.1.4.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/htrace-core4-4.1.0-incubating.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/jackson-core-asl-1.9.4.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/jackson-mapper-asl-1.9.4.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/redis-binding/lib/commons-pool2-2.4.2.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/redis-binding/lib/jedis-2.9.0.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -s -P /home/host/vmuxIO/test/moonprogs//../../ycsb/share/workloads/workloada -p redis.host=10.1.0.2 -p redis.port=6379 -p operationcount=429496729 -p maxexecutiontime=61 -threads 1
Command line: -t -db site.ycsb.db.RedisClient -s -P /home/host/vmuxIO/test/moonprogs//../../ycsb/share/workloads/workloada -p redis.host=10.1.0.2 -p redis.port=6379 -p operationcount=429496729 -p maxexecutiontime=61 -threads 1
YCSB Client 0.17.0

Loading workload...
Starting test.
Maximum execution time specified as: 61 secs
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2024-06-26 11:06:49:830 0 sec: 0 operations; est completion in 0 second 
2024-06-26 11:06:59:659 10 sec: 19047 operations; 1904.7 current ops/sec; est completion in 2 days 14 hours [READ: Count=9522, Max=208767, Min=94, Avg=475.54, 90=390, 99=3099, 99.9=7115, 99.99=205311] [UPDATE: Count=9538, Max=208255, Min=97, Avg=542.01, 90=392, 99=3213, 99.9=202495, 99.99=207871] 
2024-06-26 11:07:09:659 20 sec: 33681 operations; 1463.4 current ops/sec; est completion in 2 days 22 hours [READ: Count=7311, Max=209023, Min=89, Avg=678.47, 90=323, 99=2839, 99.9=205823, 99.99=208639] [UPDATE: Count=7310, Max=210303, Min=87, Avg=663.01, 90=311, 99=2727, 99.9=206335, 99.99=208895] 
2024-06-26 11:07:19:658 30 sec: 47805 operations; 1412.4 current ops/sec; est completion in 3 days 2 hours [READ: Count=7020, Max=210815, Min=82, Avg=862.87, 90=287, 99=2661, 99.9=207743, 99.99=209535] [UPDATE: Count=7104, Max=208639, Min=80, Avg=561.29, 90=275, 99=2647, 99.9=203007, 99.99=208511] 
2024-06-26 11:07:29:658 40 sec: 61999 operations; 1419.4 current ops/sec; est completion in 3 days 4 hours [READ: Count=7090, Max=209151, Min=84, Avg=732.09, 90=260, 99=2895, 99.9=207103, 99.99=208639] [UPDATE: Count=7104, Max=209279, Min=81, Avg=661.09, 90=247, 99=2677, 99.9=205695, 99.99=209279] 
2024-06-26 11:07:39:658 50 sec: 76006 operations; 1400.7 current ops/sec; est completion in 3 days 6 hours [READ: Count=7034, Max=209407, Min=87, Avg=762.64, 90=252, 99=2825, 99.9=206847, 99.99=207999] [UPDATE: Count=6973, Max=208767, Min=87, Avg=676.25, 90=250, 99=2637, 99.9=206591, 99.99=208383] 
2024-06-26 11:07:49:658 60 sec: 88415 operations; 1240.9 current ops/sec; est completion in 3 days 8 hours [READ: Count=6089, Max=208511, Min=87, Avg=742.21, 90=241, 99=2677, 99.9=206847, 99.99=207871] [UPDATE: Count=6320, Max=208767, Min=83, Avg=850.95, 90=238, 99=2653, 99.9=207359, 99.99=208255] 
Maximum time elapsed. Requesting stop for the workload.
Stop requested for workload. Now Joining!
2024-06-26 11:07:50:703 61 sec: 88804 operations; 372.25 current ops/sec; est completion in 3 days 9 hours [READ: Count=188, Max=204927, Min=97, Avg=3526.36, 90=375, 99=202495, 99.9=204927, 99.99=204927] [CLEANUP: Count=1, Max=1341, Min=1341, Avg=1341, 90=1341, 99=1341, 99.9=1341, 99.99=1341] [UPDATE: Count=201, Max=207231, Min=95, Avg=2293.4, 90=334, 99=3303, 99.9=207231, 99.99=207231] 
[OVERALL], RunTime(ms), 61053
[OVERALL], Throughput(ops/sec), 1454.5394984685438
[TOTAL_GCS_Copy], Count, 8
[TOTAL_GC_TIME_Copy], Time(ms), 21
[TOTAL_GC_TIME_%_Copy], Time(%), 0.03439634415999214
[TOTAL_GCS_MarkSweepCompact], Count, 0
[TOTAL_GC_TIME_MarkSweepCompact], Time(ms), 0
[TOTAL_GC_TIME_%_MarkSweepCompact], Time(%), 0.0
[TOTAL_GCs], Count, 8
[TOTAL_GC_TIME], Time(ms), 21
[TOTAL_GC_TIME_%], Time(%), 0.03439634415999214
[READ], Operations, 44254
[READ], AverageLatency(us), 706.8961223844173
[READ], MinLatency(us), 82
[READ], MaxLatency(us), 210815
[READ], 95thPercentileLatency(us), 412
[READ], 99thPercentileLatency(us), 2899
[READ], Return=OK, 44254
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1341.0
[CLEANUP], MinLatency(us), 1341
[CLEANUP], MaxLatency(us), 1341
[CLEANUP], 95thPercentileLatency(us), 1341
[CLEANUP], 99thPercentileLatency(us), 1341
[UPDATE], Operations, 44550
[UPDATE], AverageLatency(us), 656.6685746352413
[UPDATE], MinLatency(us), 80
[UPDATE], MaxLatency(us), 210303
[UPDATE], 95thPercentileLatency(us), 400
[UPDATE], 99thPercentileLatency(us), 2881
[UPDATE], Return=OK, 44550
AUTOTEST_DONE